fedex.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://fedex.com/ws/rate/v24">
<SOAP-ENV:Body>
<RateRequest>
  <WebAuthenticationDetail>
    <UserCredential>
      <Key>HaaYYa3AMmOQGZYL</Key>
      <Password>8JihjDHJ6KSnSApCtGjtEopoa</Password>
    </UserCredential>
  </WebAuthenticationDetail>
  <ClientDetail>
    <AccountNumber>510088000</AccountNumber>
    <MeterNumber>100417677</MeterNumber>
  </ClientDetail>
  <Version>
    <ServiceId>crs</ServiceId>
    <Major>24</Major>
    <Intermediate>0</Intermediate>
    <Minor>0</Minor>
  </Version>
  <ReturnTransitAndCommit>true</ReturnTransitAndCommit>
  <RequestedShipment>
    <ServiceType>FEDEX_GROUND</ServiceType>
    <Shipper>
      <Address>
        <StreetLines>10 Fed Ex Pkwy</StreetLines>
        <City>Memphis</City>
        <StateOrProvinceCode>TN</StateOrProvinceCode>
        <PostalCode>38115</PostalCode>
        <CountryCode>US</CountryCode>
      </Address>
    </Shipper>
    <Recipient>
      <Address>
        <StreetLines>13450 Farmcrest Ct</StreetLines>
        <City>Herndon</City>
        <StateOrProvinceCode>VA</StateOrProvinceCode>
        <PostalCode>20171</PostalCode>
        <CountryCode>US</CountryCode>
      </Address>
    </Recipient>
    <ShippingChargesPayment>
      <PaymentType>SENDER</PaymentType>
    </ShippingChargesPayment>
    <PackageCount>1</PackageCount>
    <RequestedPackageLineItems>
      <GroupPackageCount>1</GroupPackageCount>
      <Weight>
        <Units>LB</Units>
        <Value>2</Value>
      </Weight>
      <Dimensions>
        <Length>10</Length>
        <Width>10</Width>
        <Height>3</Height>
        <Units>IN</Units>
      </Dimensions>
    </RequestedPackageLineItems>
  </RequestedShipment>
</RateRequest>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>